app/controllers/home_controller.rb

  def index
    @events = Event.joins("INNER JOIN organizers ON organizers.event_id = events.id")
               .joins("INNER JOIN users ON organizers.user_id = users.id")
               .select("events.*, users.name")
               .order(created_at: 'desc')
---
SELECT events.*, users.name FROM "events" INNER JOIN organizers ON organizers.event_id = events.id INNER JOIN users ON organizers.user_id = users.id ORDER BY "events"."created_at" DESC