app/controllers/lists_controller.rb

  def index
    @events = Event.all.order(created_at: 'desc')
---
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC