app/controllers/lists_controller.rb

  def index
    @events = Event.joins("INNER JOIN organizers ON organizers.event_id = events.id")
               .joins("INNER JOIN users ON organizers.user_id = users.id")
               .select("events.*, users.name")
               .order(created_at: 'desc')
---
SELECT events.*, users.name FROM "events" INNER JOIN organizers ON organizers.event_id = events.id INNER JOIN users ON organizers.user_id = users.id ORDER BY "events"."created_at" DESC

  def show
    @event = Event.find(params[:id])
    @attendee = Event
               .where(id: params[:id])
               .joins("INNER JOIN participants ON participants.event_id = events.id")
               .joins("INNER JOIN users ON users.id = participants.user_id")
               .select("users.*")
    gon.doko = @event.where
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? AND "events"."id" = ? LIMIT ?  [["id", 19], ["id", 1], ["LIMIT", 1]]
SELECT users.* FROM "events" INNER JOIN participants ON participants.event_id = events.id INNER JOIN users ON users.id = participants.user_id WHERE "events"."id" = ?  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("title", "when", "where", "what", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aa"], ["when", "2017-09-17"], ["where", "aa"], ["what", "aa"], ["created_at", "2017-09-17 02:35:28.731504"], ["updated_at", "2017-09-17 02:35:28.731504"]]